<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B07(0729).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
friend_dict_list=[{'name':'Jone','age':15,'job':'student'},
                 {'name':'Jenny','age':30,'job':'developer'},
                 {'name':'Nate','age':30,'job':'teacher'}]
df=pd.DataFrame(friend_dict_list, columns=['name','age','job'])#헤더 지정

In [ ]:
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
df['salary']=0#Salary라는 열 생성

In [ ]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [ ]:
import numpy as np#넘피인줄 알았는데 넘파이라고 읽나보다

In [ ]:
df['salary']=np.where(df['job']!='student','yes','no')#job의 값이student가 아니면 연봉이 있고 student가 아닌게 아니면 연봉이 없음

In [ ]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [ ]:
friend_dict_list=[{'name':'Jone','midterm':95,'final':85},
                 {'name':'Jenny','midterm':85,'final':80},
                 {'name':'Nate','midterm':30,'final':10}]
df=pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])

In [ ]:
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df['total']=df['midterm']+df['final']#total이라는 열을 추가하는데, 이 값은 midterm값+final값

In [ ]:
df

    name  midterm  final  total
0   Jone       95     85    180
1  Jenny       85     80    165
2   Nate       30     10     40

In [ ]:
df['average']=df['total']/2#average라는 열을 추가하는데, 이 값은 total을 2로 나눈 값

In [ ]:
df

    name  midterm  final  total  average
0   Jone       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       30     10     40     20.0

In [ ]:
grades=[]
for row in df['average']:#average열에서 데이터값에 따른 성적을 매겨, 이를 grade열로 추가하기 위함
    if row>=90:#average 값이 90 이상이면 A,80이상이면 B, 그 외에는 F를 grades 에 append
        grades.append('A')
    elif row>=80:
        grades.append('B')
    else:
        grades.append('F')
df['grade']=grades

In [ ]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       30     10     40     20.0     F

In [ ]:
def pass_or_fail(row):#함수 생성, row의 값이 F가 아니라면 Pass, 맞다면 Fail 문자열 반환
    if row !='F':
        return "Pass"
    else:
        return "Fail"

In [ ]:
df.grade=df.grade.apply(pass_or_fail)#각 row마다 함수인자를 넣어 수정하겠다는 의미

In [ ]:
df

    name  midterm  final  total  average grade
0   Jone       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       30     10     40     20.0  Fail

In [ ]:
date_list=[
    {
        'yyyy-mm-dd' :'2000-06-27'
    },
    {
        'yyyy-mm-dd' :'2007-10-27'
    }
]
df=pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

In [ ]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [ ]:
def extract_year(row):#년도만을 분리하기 위함
    return row.split('-')[0]#0번째 인자만 분리

In [ ]:
df['year']=df['yyyy-mm-dd'].apply(extract_year)#year라는 열을 추가해 apply

In [ ]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [ ]:
friend_dict_list=[{'name':'Jone','midterm':95,'final':85},
                 {'name':'Jenny','midterm':85,'final':80},
                 {'name':'Nate','midterm':30,'final':10}]
df=pd.DataFrame(friend_dict_list, columns=['name','midterm','final'])

In [ ]:
df

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10

In [ ]:
df2=pd.DataFrame([
    ['Ben',50,50]
], columns=['name','midterm','final'])

In [ ]:
df2#해당 DataFrame을 기존의 friend_dict_list 데이터프레임과 병합할거임

  name  midterm  final
0  Ben       50     50

In [ ]:
df.append(df2,ignore_index=True)#해당 데이터프레임을 새 행으로 추가,현재 df2의 인덱스도 0이므로 ignore하여 기존 df와 병합

    name  midterm  final
0   Jone       95     85
1  Jenny       85     80
2   Nate       30     10
3    Ben       50     50